# GetSubelement Method (ElementId, Int32)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..GetSubelement Method (ElementId, Int32)
Document Class See Also
---
Gets the subelement referenced by a parent id and subelement id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public Subelement GetSubelement(
	ElementId id,
	int subId
)
```

Visual Basic
---
```text
Public Function GetSubelement ( _
	id As ElementId, _
	subId As Integer _
) As Subelement
```

Visual C++
---
```text
public:
Subelement^ GetSubelement(
	ElementId^ id,
	int subId
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..ElementId Id of the element.
subId
    Type: System..::..Int32 Id of the sub element.
# ### Return Value
The subelement referenced by the input argument.
# Remarks
nullNothingnullptra null reference (Nothing in Visual Basic) will be returned if the input id string doesn't reference to a valid element or subelement.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Document Class
GetSubelement Overload
Autodesk.Revit.DB Namespace